import pandas as pd

# Загрузка данных
df = pd.read_csv("combined_file (6).csv")

# Список городов Московской области
mo_cities_list = [
    "Балашиха",
    "Химки",
    "Подольск",
    "Королёв",
    "Мытищи",
    "Люберцы",
    "Красногорск",
    "Электросталь",
    "Коломна",
    "Одинцово",
    "Долгопрудный",
    "Фрязино",
    "Жуковский",
    "Краснознаменск",
    "Лобня",
    "Реутов",
    "Видное",
    "Ивантеевка",
    "Климовск",
    "Юбилейный",
    "Солнечногорск",
    "Серпухов",
    "Орехово-Зуево",
    "Щёлково",
    "Пушкино",
    "Дмитров",
    "Дубна",
    "Егорьевск",
    "Кашира",
    "Протвино",
    "Сергиев Посад",
    "Троицк",
    "Черноголовка",
    "Ногинск",
    "Ступино",
    "Раменское",
    "Домодедово",
    "Лыткарино",
    "Истра",
    "Наро-Фоминск",
    "Лосино-Петровский",
    "Щербинка",
    "Бронницы",
    "Электрогорск",
    "Ликино-Дулёво",
    "Куровское",
    "Зарайск",
    "Озёры",
    "Луховицы",
    "Рошаль",
]

# Фильтрация данных по городам Москвы и Московской области
msk_cities = df[df["location"] == "Москва"]
mo_cities = df[df["location"].isin(mo_cities_list)]

# Подсчет количества вхождений каждого города
msk_count = msk_cities["location"].value_counts()
mo_count = mo_cities["location"].value_counts()

# Вывод результатов
print("Количество городов в Москве:")
print(msk_count)

print("\nКоличество городов в Московской области:")
print(mo_count)

